---
title: "Jaunty boots to a black screen with cursor"
date: 2009-04-23
forum: Installation &amp; Upgrades
---

### Post by RobertWaelder on 2009-04-23
This was already posted [at this link]("http://ubuntuforums.org/showthread.php?t=1129192&highlight=jaunty+black+screen+after+login"). Since the Jaunty testing forum is closed now, I'd like to resurrect this post. So basically, after I input my name and password at the login screen, the screen goes black and I am left with a lonely little arrow (the cursor). It pretty much just stays there indefinitely. I can access a terminal via Ctrl + Alt + Fn, and everything in the console works fine. First I tried removing "nvidia-common" using apt-get as recommended in the previous thread, but when I rebooted, same deal. Then I booted using Failsafe mode in Gnome. This was a little more successful, as I actually got to see the wallpaper, but not soon after that I received two error messages. The first: "There is a problem with the configuration server. (/usr/lib/libgconf2-4/gconf-sanity-check-2 exited with status 256)" and the next: "Nautilus could not create the following required folders: /home/robzilla/Desktop, /home/robzilla/.nautilus. Before running Nautilus, please create these folders, or set permissions such that Nautilus can create them." Soooo.... if anyone could help me figure this issue out, I would be extremely grateful. I really wanna try out Jaunty!:popcorn:

Oh btw, misc information: I'm running 64-bit Ubuntu on an HP Pavilion dv9000, and I'm dual booting alongside Windows.

---

### Post by danlea on 2009-04-24
It could be the same issue I was having (and took me literally all day to figure out).  Is your ~/.pulse directory owned by root?  If so, delete it.

---

### Post by RobertWaelder on 2009-04-24
Hmm, I think I'll try just changing the permissions before I delete it, but I'll try that! Thanks.

---

### Post by RobertWaelder on 2009-04-24
Hmm, I did ls -a on /home/robzilla, but all I saw was .pulse-cookie (which was a blank text file). Wierd. I think I'll try uninstalling pulse audio altogether.

---

### Post by danlea on 2009-04-24
Well the bug is detailed at the link below, so if it's not applicable to you, there's no need to uninstall pulse audio.  I found it through the ~/.xsessions-errors line:
E: core-util.c: Failed to create secure directory: Permission denied

[https://bugs.launchpad.net/ubuntu/+source/pulseaudio/+bug/330766](https://bugs.launchpad.net/ubuntu/+source/pulseaudio/+bug/330766)

---

### Post by RobertWaelder on 2009-04-24
I looked in /root and found a .pulse directory. When I moved it to my home directory, I was able to get a little bit further, and I actually heard the startup sound. It was a little jilted and wonky sounding though. Anyway, I got the same error messages as if I had logged in through the failsafe mode. I decided to check the log file that the first error message mentioned for any clues, and it was a bunch of garbled text with the occasional bit of readable text. I was told it "may be a binary file". I read the readable bits, and it mentioned something about problems with separately mounted /home directories (which I suspected anyway). I'll try to get that file copied to a USB drive so I can post it. Maybe someone will be able to make sense of it.

---

### Post by RobertWaelder on 2009-04-24
Here is the full log file created by the error message. It's rather confusing, so I'll post the full one, plus an abridged version with the important stuff in it.

[PHP]ELF          >     @     @       `2          @ 8 	 @         @       @ @     @ @     酶      酶                   8      8@     8@                                          @       @     |'      |'                    赂-      赂-`     赂-`     篓      脠                    脿-      脿-`     脿-`                                T      T@     T@                            P氓td   h&      h&@     h&@     4       4              Q氓td                                                  R氓td   赂-      赂-`     赂-`     H      H             /lib64/ld-linux-x86-64.so.2          GNU                  %   :      '          6                     4            #      &       /   7   +   ,          (   9          3   1      *   )           $   %                               8                                               -                                  	      5   2                           
   .   "   !                      0          
                         -         聬&#8364; !	
&#710; @-   0   8   j	C脰潞茫&#8217;|CE脮矛:&#8212;2b脹铆卢K茫脌fUa脷脥茫&#382;脴qXj&#353;|鹿聧帽芒&#382;毛脫茂                        聧                                                                 煤                     %                      猫                     2                      H                       W                       脮                     冒                     5                     脕                     &#8250;                     &#8224;                     ,                     o                     k                      &#8218;                      拢                     &#8220;                      `                     &#376;                      i                     &                     S                     潞                      =                     脙                                           没                     虏                     脫                      毛                      眉                                                                +                     8                     B                     {                     U                                                                ~    P1`             Z   帽每&#8364;1`             G   帽每`1`             &#8364;     P1`             &#8222;   
  @             o    @            &    `1`            &#8249;   
 @@     &#8240;       N   帽每`1`             B   
  @     +      芦    P@             _   
 0@            i    @              libgtk-x11-2.0.so.0 g_free g_unlink g_slist_free g_option_context_free __gmon_start__ _Jv_RegisterClasses g_option_context_parse g_strdup_vprintf g_set_error g_option_context_add_group g_getenv g_file_open_tmp g_file_error_from_errno g_build_filename g_strerror g_option_context_new g_get_home_dir g_error_free g_mkstemp g_file_error_quark g_dgettext gtk_init_check gtk_dialog_add_buttons gtk_get_option_group gtk_message_dialog_new gtk_dialog_run gtk_dialog_get_type gtk_widget_destroy g_print g_printerr g_type_check_instance_cast libgconf-2.so.4 gconf_load_source_path gconf_resolve_address gconf_blow_away_locks gconf_ping_daemon gconf_source_free gconf_use_local_locks g_thread_init libgthread-2.0.so.0 libgobject-2.0.so.0 libglib-2.0.so.0 libpthread.so.0 close open __errno_location fcntl libc.so.6 stdin _IO_getc __libc_start_main _edata __bss_start _end __libc_csu_fini _IO_stdin_used __data_start __libc_csu_init GLIBC_2.2.5                                                                                                                  ui	   &#8250;        锚         ui	   &#8250;      脿/`                   `1`        3            0`                   0`                   0`                   0`                    0`                   (0`                   00`                   80`        
           @0`                   H0`                   P0`        
           X0`                   `0`                   h0`                   p0`                   x0`                   &#8364;0`                   &#710;0`                   聬0`                   &#732;0`                   *0`                   篓0`                   掳0`                   赂0`                   脌0`                   脠0`                   脨0`                   脴0`                   脿0`                   猫0`                    冒0`        !           酶0`        "            1`        #           1`        $           1`        %           1`        &            1`        '           (1`        (           01`        )           81`        *           @1`        +           H1`        ,           H&#402;矛猫贸  猫&#8218;  猫m  H&#402;脛脙每5&#8218;  每%&#8222;  @ 每%&#8218;  h    茅脿每每每每%z  h   茅脨每每每每%r  h   茅脌每每每每%j  h   茅掳每每每每%b  h   茅*每每每每%Z  h   茅聬每每每每%R  h   茅&#8364;每每每每%J  h   茅p每每每每%B  h   茅`每每每每%:  h	   茅P每每每每%2  h
   茅@每每每每%*  h   茅0每每每每%"  h   茅 每每每每%  h
   茅每每每每%  h   茅 每每每每%
  h   茅冒镁每每每%  h   茅脿镁每每每%煤  h   茅脨镁每每每%貌  h   茅脌镁每每每%锚  h   茅掳镁每每每%芒  h   茅*镁每每每%脷  h   茅聬镁每每每%脪  h   茅&#8364;镁每每每%脢  h   茅p镁每每每%脗  h   茅`镁每每每%潞  h   茅P镁每每每%虏  h   茅@镁每每每%陋  h   茅0镁每每每%垄  h   茅 镁每每每%&#353;  h   茅镁每每每%&#8217;  h   茅 镁每每每%&#352;  h   茅冒媒每每每%&#8218;  h    茅脿媒每每每%z  h!   茅脨媒每每每%r  h"   茅脌媒每每每%j  h#   茅掳媒每每每%b  h$   茅*媒每每每%Z  h%   茅聬媒每每每%R  h&   茅&#8364;媒每每每%J  h'   茅p媒每每每%B  h(   茅`媒每每每%:  h)   茅P媒每每        1铆I&#8240;脩^H&#8240;芒H&#402;盲冒PTI脟脌0@ H脟脕@@ H脟脟 @ 猫驴媒每每么聬聬H&#402;矛H&#8249;&#8240;  H&#8230;脌t每脨H&#402;脛脙聬聬聬聬聬聬聬聬聬聬聬聬聬UH&#8240;氓SH&#402;矛&#8364;=猫   uK赂脨-` H&#8249;芒  H-脠-` H脕酶H聧X每H9脷s%&#8364;    H聧BH&#8240;陆  每脜脠-` H&#8249;炉  H9脷r芒脝&#8250;  H&#402;脛[脡脙fff.&#8222;     UH&#402;=茂   H&#8240;氓t赂    H&#8230;脌t驴脴-` I&#8240;脙脡A每茫@ 脡脙聬聬聬聬聬聬USH聛矛脴   H&#8240;T$0露脨H&#8240;t$(H聧&#8226;    潞r@ H&#8240;L$8L&#8240;D$@L&#8240;L$HH&#8240;忙H)脗H聧&#8222;$脧   每芒)x帽)p谩)h脩)`脕)X卤)P隆)H&#8216;)@聛H聧&#8222;$冒   脟$   脟D$0   H&#8240;D$H聧D$ H&#8240;D$猫脹眉每每&#8249;脵  H&#8240;脜&#8230;脪&#8222;&#8218;   &#8249;脛  &#8230;脌tXI&#8240;茅A赂@ 鹿   潞   1枚1每1脌猫R眉每每H&#8240;茂H&#8240;脙猫搂没每每猫2眉每每H&#8240;脽H&#8240;脝猫G媒每每H&#8240;脟猫O媒每每H&#8240;脽猫莽没每每H聛脛脴   []脙D  H&#8240;卯驴搂@ 1脌猫脵没每每H聛脛脴   []脙&#8364;    1枚1每猫o眉每每脟9     &#8240;/  茅`每每每f聬H&#8240;\$脨L&#8240;t$冒E1枚L&#8240;|$酶H&#8240;l$脴A&#8240;每L&#8240;d$脿L&#8240;l$猫H&#402;矛H猫K眉每每&#8230;脌禄   t2L&#8240;梅猫煤煤每每&#8240;脴H&#8249;l$ H&#8249;\$L&#8249;d$(L&#8249;l$0L&#8249;t$8L&#8249;|$@H&#402;脛H脙D  L聧l$1脪戮@ 驴$@ 1脌猫&#732;眉每每L&#8240;卯H&#8240;脟I&#8240;脝H脟D$    猫帽没每每H&#8230;脌I&#8240;脛H&#8240;脙&#8222;垄   f.&#8222;     H&#8249;+L&#8240;卯H脟D$    H&#8240;茂猫帽没每每H&#8249;|$H&#8230;每u/H&#8240;脟猫炉眉每每H&#8249;;猫W煤每每H&#8249;[H&#8230;脹u脝L&#8240;莽鲁猫t煤每每茅=每每每&#8364;    E&#8230;每D  t+H&#8249;_戮* @ 驴J@ 猫{眉每每L&#8240;貌H&#8240;脟H&#8240;卯H&#8240;脵1脌猫聬媒每每H&#8249;|$猫眉每每1脹茅玫镁每每&#8364;    E&#8230;每tJH&#8249;D$禄陋@ H&#8240;脻H&#8230;脌t戮1@ 驴J@ H&#8249;h猫&眉每每H&#8240;脙戮脴@ 驴J@ 猫眉每每H&#8240;茅H&#8240;脟H&#8240;脷L&#8240;枚1脌猫)媒每每H&#8249;|$1脹H&#8230;每u&#8217;茅&#381;镁每每&#8222;     H&#8240;\$脿L&#8240;d$猫L&#8240;l$冒L&#8240;t$酶H&#402;矛x&#8240;|$1每H&#8240;4$猫a煤每每戮Q@ 驴J@ 猫虏没每每H&#8240;脟猫J没每每1每H&#8240;脙猫冒霉每每H&#8240;脽H&#8240;脝猫e煤每每H聧L$HH聧t$H&#8240;芒H&#8240;脽H脟D$H    猫梅霉每每H&#8240;脽猫_霉每每H&#8249;T$HH&#8230;脪t]H&#8249;$L&#8249;b戮8!@ 驴J@ H&#8249;猫K没每每L&#8240;忙H&#8240;脟1脌H&#8240;脷猫K霉每每H&#8249;|$H猫帽煤每每潞   &#8240;脨H&#8249;\$XL&#8249;d$`L&#8249;l$hL&#8249;t$pH&#402;脛x脙f&#8222;     H脟D$@    猫&#352;酶每每&#8230;脌&#8222;脷   驴k@ H脟D$8    猫茂霉每每H&#8230;脌&#8222;>  驴k@ 猫脺霉每每1脪H&#8240;脟戮*!@ 1脌猫;煤每每H&#8240;脟H&#8240;D$@猫~煤每每&#402;酶每A&#8240;脝&#8222;*  L&#8249;d$8M&#8230;盲&#8222;脌   猫脧霉每每L&#8249;l$@&#8249;戮脿!@ M&#8249;d$驴J@ 猫t煤每每L&#8240;卯H&#8240;脟&#8240;脵L&#8240;芒1脌E1铆猫&#8225;没每每H&#8249;|$8猫煤每每D&#8240;梅猫
酶每每H&#8249;|$@猫贸梅每每&#8230;脌&#710;c  H&#8249;|$@猫脩梅每每E&#8230;铆&#8230;脴   潞   茅貌镁每每fD  猫脙霉每每1脪H&#8240;脟戮x@ 1脌猫&#8218;霉每每H&#8240;脟H&#8240;D$@猫楼梅每每H&#8249;|$@1脌潞脌  戮A   猫每霉每每&#8230;脌A&#8240;脝&#710;脺  H聧T$1脌戮   D&#8240;梅f脟D$ H脟D$    f脟D$  H脟D$     A陆   猫陋霉每每&#8230;脌&#8240;=每每每猫脥酶每每&#8249;&#8240;脽猫霉每每L&#8249;l$@I&#8240;脛戮 #@ 驴J@ 猫m霉每每L&#8240;卯H&#8240;脟&#8240;脵L&#8240;芒1脌E1铆猫&#8364;煤每每茅镁镁每每 1每猫卤没每每1脪&#8230;脌D  &#8230;镁每每戮脠$@ 驴J@ 猫+霉每每&#8249;5鹿  H&#8240;脙&#8230;枚&#8222;'  &#8249;
陇  &#8230;脡&#8222;脴  I&#8240;脵1脡A赂@ 潞   1枚1每1脌猫1梅每每戮芦@ 驴J@ I&#8240;脛猫脽酶每每戮碌@ 驴J@ I&#8240;脝猫脥酶每每I&#8240;脜猫玫枚每每L&#8240;莽H&#8240;脝H&#8240;脙猫酶每每E1脡A赂媒每每每L&#8240;帽潞镁每每每H&#8240;脟L&#8240;卯1脌猫	梅每每H&#8240;脼L&#8240;莽猫脼梅每每H&#8240;脟猫忙梅每每L&#8240;莽&#8240;脙猫|枚每每&#402;没媒&#8230;K镁每每1脪戮@ 驴$@ 1脌猫脿梅每每1枚H&#8240;脙H&#8240;脟猫C梅每每H&#8240;脽I&#8240;脛猫猫玫每每M&#8230;盲L&#8240;茫&#8222;n  @ H&#8249;;猫0梅每每H&#8249;;猫脠玫每每H&#8249;[H&#8230;脹u莽L&#8240;莽猫莽玫每每驴   猫u煤每每1脪&#8230;脌&#8221;脗茅脮眉每每f&#8222;     猫3梅每每&#8249;&#8240;脽猫z梅每每L&#8249;l$@I&#8240;脛戮脿!@ 茅a镁每每猫梅每每&#8249;8猫\梅每每L&#8249;d$@H&#8240;脙戮&#8216;@ 驴J@ 猫碌梅每每H&#8240;脷H&#8240;脟L&#8240;忙1脌猫碌玫每每茅e媒每每&#8222;     H聧T$8H聧t$@驴*!@ 猫麓枚每每A&#8240;脝茅脷眉每每@ 猫鲁枚每每&#8249;&#8240;脽猫煤枚每每L&#8249;l$@&#8240;脽I&#8240;脛猫脣枚每每&#8240;脙猫4梅每每H聧|$8&#8240;脝M&#8240;谩M&#8240;猫鹿脌!@ &#8240;脷1脌猫茅玫每每茅&#8217;眉每每戮戮@ 驴J@ 猫%梅每每H&#8240;脼H&#8240;脟1脌猫酶么每每H&#8249;=&#8240;  猫l玫每每&#402;酶Y&#8222;聬镁每每&#402;酶y&#8230;脪眉每每f聬茅&#8364;镁每每1枚1每&#8364;    猫拢玫每每脟m     &#8240;c  茅麓媒每每驴8&@ 1脌猫脪么每每茅&#382;镁每每聬聬聬聬聬贸脙fffff.&#8222;     H&#8240;l$脴L&#8240;|$酶H聧-c  L聧=\  L&#8240;d$脿L&#8240;l$猫L&#8240;t$冒H&#8240;\$脨H&#402;矛8L)媒A&#8240;镁I&#8240;玫H脕媒I&#8240;脭猫脣贸每每H&#8230;铆t1脹@ L&#8240;芒L&#8240;卯D&#8240;梅A每脽H&#402;脙H9毛r锚H&#8249;\$H&#8249;l$L&#8249;d$L&#8249;l$ L&#8249;t$(L&#8249;|$0H&#402;脛8脙聬聬聬聬聬聬聬UH&#8240;氓SH&#402;矛H&#8249;脴  H&#402;酶每t禄赂-` D  H&#402;毛每脨H&#8249;H&#402;酶每u帽H&#402;脛[脡脙聬聬H&#402;矛猫_枚每每H&#402;脛脙    %s path /etc/gconf/2 Error reading the file:  GConf2 - Sanity checks for GConf GCONF_TMPDIR .gconf-test-locking-file Can't remove file %s: %s
 _Continue _Log Out %s Continue (y/n)?        Please contact your system administrator to resolve the following problem:
No configuration sources in the configuration file "%s"; this means that preferences and other settings can't be saved. %s%s Please contact your system administrator to resolve the following problem:
Could not resolve the address "%s" in the configuration file "%s": %s        Error while parsing options: %s.
Run '%s --help' to see a full list of available command line options.
 gconf-test-locking-file-XXXXXX  Failed to create file '%s': %s  Please contact your system administrator to resolve the following problem:
Could not open or create the file "%s"; this indicates that there may be a problem with your configuration, as many programs will need to create files in your home directory. The error was "%s" (errno = %d).      Please contact your system administrator to resolve the following problem:
Could not lock the file "%s"; this indicates that there may be a problem with your operating system configuration. If you have an NFS-mounted home directory, either the client or the server may be set up incorrectly. See the rpc.statd and rpc.lockd documentation. A common cause of this error is that the "nfslock" service has been disabled.The error was "%s" (errno = %d).        The files that contain your preference settings are currently in use.

You might be logged in to a session from another computer, and the other login session is using your preference settings files.

You can continue to use the current session, but this might cause temporary problems with the preference settings in the other session.

Do you want to continue?       Failed to load addresses to delete locks
       ;4      篓茂每每P   猫冒每每p   &#732;貌每每&#732;   脠梅每每脨   脴梅每每猫              zR x聬        @ >   AAG冒&#402;&#8224; $   <   P@ 篓   J&#381;&#402;M&#8224;聫QP聧&#338;         d    @ +   X&#8364;&#381;聧&#338;&#402;          zR x聬        冒枚每每           $   4   猫枚每每&#8240;    J聫&#8224;f@&#402;&#381;聧&#338;                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       每每每每每每每每        每每每每每每每每                                                  卤             脜             脵             锚                          P@     
       @            x@     玫镁每o     @            脨	@            `@     
       搂                                          猫/`            冒                           `@            0@            0       	              镁每每o    冒
@     每每每o           冒每每o    x
@                                                                                                             脿-`                     ~@     &#381;@     &#382;@     庐@     戮@     脦@     脼@     卯@     镁@     @     @     .@     >@     N@     ^@     n@     ~@     &#381;@     &#382;@     庐@     戮@     脦@     脼@     卯@     镁@     @     @     .@     >@     N@     ^@     n@     ~@     &#381;@     &#382;@     庐@     戮@     脦@     脼@     卯@     镁@     @                     gconf-sanity-check-2    脥聫y .shstrtab .interp .note.ABI-tag .gnu.hash .dynsym .dynstr .gnu.version .gnu.version_r .rela.dyn .rela.plt .init .text .fini .rodata .eh_frame_hdr .eh_frame .ctors .dtors .jcr .dynamic .got .got.plt .data .bss .gnu_debuglink                                                                                 8@     8                                                 T@     T                                     %             x@     x      &#8222;                           !   枚每每o        @            `                             +             `@     `      p                          3             脨	@     脨	      搂                             ;   每每每o       x
@     x
      t                            H   镁每每o       冒
@     冒
      @                            W             0@     0      0                            a             `@     `      冒                          k             P@     P                                    f             h@     h      掳                            q              @            猫	                             w             @                                         }             @           P                             &#8230;             h&@     h&      4                              &#8220;             *&@     *&      脺                              聺             赂-`     赂-                                    陇             脠-`     脠-                                    芦             脴-`     脴-                                    掳             脿-`     脿-                                  鹿             脿/`     脿/                                   戮             猫/`     猫/      h                            脟             P1`     P1                                    脥             `1`     `1                                     脪                      `1                                                          |1      谩                              [/PHP]

[PHP]%s path /etc/gconf/2 Error reading the file:  GConf2 - Sanity checks for GConf GCONF_TMPDIR .gconf-test-locking-file Can't remove file %s: %s
 _Continue _Log Out %s Continue (y/n)?        Please contact your system administrator to resolve the following problem:
No configuration sources in the configuration file "%s"; this means that preferences and other settings can't be saved. %s%s Please contact your system administrator to resolve the following problem:
Could not resolve the address "%s" in the configuration file "%s": %s        Error while parsing options: %s.
Run '%s --help' to see a full list of available command line options.
 gconf-test-locking-file-XXXXXX  Failed to create file '%s': %s  Please contact your system administrator to resolve the following problem:
Could not open or create the file "%s"; this indicates that there may be a problem with your configuration, as many programs will need to create files in your home directory. The error was "%s" (errno = %d).      Please contact your system administrator to resolve the following problem:
Could not lock the file "%s"; this indicates that there may be a problem with your operating system configuration. If you have an NFS-mounted home directory, either the client or the server may be set up incorrectly. See the rpc.statd and rpc.lockd documentation. A common cause of this error is that the "nfslock" service has been disabled.The error was "%s" (errno = %d).        The files that contain your preference settings are currently in use.

You might be logged in to a session from another computer, and the other login session is using your preference settings files.

You can continue to use the current session, but this might cause temporary problems with the preference settings in the other session.

Do you want to continue?       Failed to load addresses to delete locks[/PHP]

I'm going to try completely uninstalling pulseaudio via apt-get. Couldn't hurt, right?

EDIT: Completely removing pulse-audio had no effect.

---

### Post by p310don on 2009-04-25
I had the issue when upgrading from 8.10 to  9.04 where I left the computer to do its thing for an hour or so, and when I came back, I had a black screen with a cursor, nothing else. I reset the machine, got a login which looked normal, so did the usual, however it came back to the black screen with mouse cursor and nothing at all. After much searching and mucking around, I discovered a solution. Apparently the upgrade didn't finish. To do so, open terminal, ie ctrl alt f2 and type

[B]sudo dpkg --configure -a

Let it continue the upgrade, which took about ten to fifteen mins, then when all is done, type

sudo reboot

And then login. This got me to the gnome desktop, where the notification icon told me a I had a bunch of updates. After installing all updates, I'm now enjoying 9.04.

Hope this helps other users who are also losing hair from frustration. :)
[/B]

---

### Post by RobertWaelder on 2009-04-25
So simple it just might work!

---

### Post by RobertWaelder on 2009-04-25
That didn't work either :-( I am sad now.

---

### Post by pavel__ on 2009-04-26
[http://ubuntuforums.org/showthread.php?t=1135402](http://ubuntuforums.org/showthread.php?t=1135402)

same thing, but already by using livecd, without installing at all.

---

### Post by RobertWaelder on 2009-04-29
So I figured it out. I am now the proud user of a shiny new Jaunty installation, w00t. :) Basically, I failed to realize when I imported all my Windows settings that I had filled up the /home partition to capacity and nautilus and some configuration programs couldn't create the files they needed to start up. When I did 'df' at the terminal I saw my drive was full and had an aha moment haha. I simply deleted some of the data from the hard drive and voila! Working installation. Thanks everyone for your help and advice!

---

### Post by Snif on 2009-06-16
Had the same error after upgrading from 8.10, alongwith "users $HOME/.dmcr file is being ignored....user's $HOME directory must be owned by user and not writeable to other users" ( [http://ubuntuforums.org/showthread.php?t=1062651]("http://ubuntuforums.org/showthread.php?t=1062651") ) problem.
Black screen with cursor fixed with
```
sudo chown -R user:user /home/user
sudo chmod -R 744 /home/user/
sudo chmod 777 /home/user/.dmcr
```

BTW, I had no .dmcr file in my home directory, so I created it as user.

It may be something wrong with those commands, but they fix the problem. 
Please correct me if there's something wrong!

Regards, Michael.

---

### Post by mhgsys on 2009-06-16
> **Snif said:**
> H
It may be something wrong with those commands, but they fix the problem. 
Please correct me if there's something wrong!

Regards, Michael.

I've seen that error get fixed with these commands;

```

sudo chmod 644 /home/username/.dmrc

```
```

sudo chown username /home/username/.dmrc

```
```

sudo chmod 755 /home/username

```

---

